#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repository["se-services"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"da325e12aaa817171de8c89d0537c28a3e1e457b3ea59efa6e39324811c539f2\"" -> "W/\"c50f9d618f7053705399a75a28a9481bf328e39b2a69693e0c2d9e4cb8160b6a\""
        id            = "se-services:develop"
      ~ sha           = "339c947a8b10f7fa7635eddd1b05893631ebae55" -> "52fd1ddceab3bbd6d77decd85593d8ebf004537b"
        # (5 unchanged attributes hidden)
    }

  # module.repository["tool-simulation"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"a0bc7aa26a1fd3f771410616ae8736c32445a9eade01627fd5c9cee577880918\"" -> "W/\"037068f7e475d651a97fc03d7a95f8db424784b7e8357cc850dd5c789ffdfbcf\""
        id            = "tool-simulation:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository["website"].github_branch.branch["staging"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"8be0f8d271c21e114edf48e050722b500819274a9bfc450733c1fa7b42b42c39\"" -> "W/\"cc073a8e4fefd6b6af749c1ded570e0a9176a91c4d58aa31a6e1c999541b1f02\""
        id            = "website:staging"
      ~ sha           = "c195a02fbcc585047093d1312219b1ecdc49ae1c" -> "03c724e372fb6941a498c7c7e2a482400864f2f8"
        # (4 unchanged attributes hidden)
    }

  # module.repository_lib_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"450f2b243ca26322c8726728f6ef6aad399ba5bcdd08775b9d81560ef3df1da5\"" -> "W/\"45514b20a33fee45492973b8c66b1e53c5ee1cc78e662ad3661cf1df895e1cfd\""
        id            = "lib-template-rust:develop"
      ~ sha           = "152c12404fc2c661acf8760d17ab23860cb1d657" -> "42ff6b06a3c6ca15f50ef895be67adda30af4999"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"b9210a329b3422e3a81521af9d92d74ed3ff54adc1acfae23ab43d6d08dca164\"" -> "W/\"1f59ed8b976a9801ba4e73f6c393f00f98e2a2652853b59fe5be3d71155e1a8d\""
        id            = "lib-router:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"1aba8c78f09445a68af0d1688aa613580c22c6fe0773feaaebdd8cc85f04c96a\"" -> "W/\"642a6d85a3aac7e28c0d01a5ee34a4270ad9162cb4b1c893cfd950692f9f5ec4\""
        id            = "svc-cargo:develop"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_svc["pricing"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"c575027b9f87292e7e424ce449fe94c194bc6277196e8f42bc0e7286cc25d95a\"" -> "W/\"ae4b0265b75d6908e2382d5aff90ca5d0b77d9b09f1e6490a2ebe391a0920c51\""
        id            = "svc-pricing:develop"
      ~ sha           = "6eba263ec885a2c4a9d769e15098b4f011a42dfd" -> "e066d426498408350072202cfbf2308427cbe9cc"
        # (4 unchanged attributes hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"0ef16cd5f3a90f790f3aaa1b7e12aee1a82922009c4b0e7033bfa5bb61013906\"" -> "W/\"88c169a366a717aebde625ce2956fc312d0ff621605364d67da3b2eb97633517\""
        id            = "svc-scheduler:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"6904b0067efe849f1d2e32882ebc4d139af9c47623f86c463f88675d66a9616a\"" -> "W/\"060be4d2d6fbc6729b1e20459504e2d1a7da9688a7fffc1ff1ab5dcbe2afea8c\""
        id            = "svc-storage:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["python"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"6b99876ed6f5d76c5f18ca99d71cd839b3308b1f1f17ea09c1a794ed88b86975\"" -> "W/\"940aedae94f798feab9c9a2d473c10683ef2138f82e5a83a646e27ec1e6b5755\""
        id            = "svc-template-python:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"2677d1940af988fb9d7a362f1850e7ee51331d86436d17c7cf38bb6c47c4a27a\"" -> "W/\"7ca5313d13fb4ed921993a64f7b1207be2c11ded8e3f08923613554a1e253e5b\""
        id            = "svc-template-rust:develop"
      ~ sha           = "3f0d6855113024db78f89827890be1305a15a028" -> "a8403c69bc67deab9d00ea320521ff095a1e397a"
        # (5 unchanged attributes hidden)
    }

  # module.repository_svc_template["typescript"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"84d18cd913f543eb55cf4988effe4732ad23fa72d340810130a490a6314fae7a\"" -> "W/\"ab1a32b519d4cef3d40c62a93402c0f341dad4fd50763284328ee811a0e923d1\""
        id            = "svc-template-typescript:develop"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository["atc-core"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "atc-core"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository["atc-core"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "atc-core"
    }

  # module.repository["atc-core"].github_branch_protection.all["atc-core"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "atc-core"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository["atc-core"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "atc-core"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository["atc-core"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "atc-core"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository["atc-core"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Air Traffic Control Library for UAM Activities"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "atc-core"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
    }

  # module.repository["atc-core"].github_repository_file.files[".cargo-husky/hooks/README.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT EDIT! This file was provisioned by Terraform
            
            These hooks will be copied to `.git/hooks/` when `cargo test` is run.
            
            :exclamation: If editing these hooks, you will need to delete the `target/`
            directory and re-run `cargo test`.
        EOT
      + file                = ".cargo-husky/hooks/README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["atc-core"].github_repository_file.files[".cargo-husky/hooks/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            ##
            #
            # This hook was set by cargo-husky v1.5.0: https://github.com/rhysd/cargo-husky#readme
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            NC=$(tput setaf 9)
            BOLD=$(tput bold)
            SGR0=$(tput sgr0)
            
            echo -e "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${SGR0}"
            
            set -e
            
            # RUST
            make rust-test
            
            # PYTHON 3
            make python-test
            
            # TOML formatting
            make toml-test
            
            # Style Check
            make editorconfig-test
            
            # Spell Check
            make cspell-test
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!${NC}${SGR0}"
        EOT
      + file                = ".cargo-husky/hooks/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["atc-core"].github_repository_file.files[".cargo-husky/hooks/pre-push"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ### DO NOT EDIT!
            # This file was provisioned by Terraform
            #
            # Do nothing
        EOT
      + file                = ".cargo-husky/hooks/pre-push"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["atc-core"].github_repository_file.files[".cargo/config.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # DO NOT EDIT
            # This file was provisioned by Terraform
            
            # https://doc.rust-lang.org/cargo/reference/config.html
            
            [build]
            rustflags = [
              "-Wmissing_docs",
              "-Wmissing_debug_implementations",
              "-Wmissing_copy_implementations",
              "-Wtrivial_casts",
              "-Wtrivial_numeric_casts",
              "-Wunsafe_code",
              "-Wunstable_features",
              "-Wunused_import_braces",
              "-Wunused_qualifications",
            ]
        EOT
      + file                = ".cargo/config.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["atc-core"].github_repository_file.files[".cspell.config.yaml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            $schema: https://raw.githubusercontent.com/streetsidesoftware/cspell/main/cspell.schema.json
            version: '0.2'
            language: "en"
            dictionaryDefinitions:
              - name: project-words
                path: './.cspell.project-words.txt'
                addWords: true
            dictionaries: ["project-words"]
            ignorePaths:
              - './.cspell.project-words.txt'
              - '**/vscode-extension/**'
              - '**/.git/**'
              - '**/target/**'
              - '.vscode'
        EOT
      + file                = ".cspell.config.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["atc-core"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [*.md]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [{*.yml,*.yaml,*.toml}]
            indent_size = 2
            [Makefile*]
            indent_style = tab
            indent_size = 4
            
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["atc-core"].github_repository_file.files[".github/CODEOWNERS"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["atc-core"].github_repository_file.files[".github/workflows/pr_rebase.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            name: PR Rebase
            
            env:
              TERM: xterm
            
            on:
              issue_comment:
                types: [created]
            
            jobs:
              rebase:
                name: Rebase
                if: >-
                  github.event.issue.pull_request != '' &&
                  (
                    contains(github.event.comment.body, '/autosquash') ||
                    contains(github.event.comment.body, '/fixup') ||
                    contains(github.event.comment.body, '/rebase')
                  )
                runs-on: ubuntu-latest
                permissions:
                  issues: write
                  pull-requests: write
                  contents: write
                steps:
                  - name: Checkout the latest code
                    uses: actions/checkout@v3
                    with:
                      token: ${{ secrets.GITHUB_TOKEN }}
                      fetch-depth: 0 # otherwise, you will fail to push refs to dest repo
                  - name: Automatic Rebase
                    uses: cirrus-actions/rebase@1.7
                    with:
                      autosquash: ${{ true }}
                    env:
                      GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}
        EOT
      + file                = ".github/workflows/pr_rebase.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["atc-core"].github_repository_file.files[".github/workflows/python_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Python Checks
            
            env:
              TERM: xterm
            
            jobs:
              formatting-check:
                name: Formatting Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make python-test
        EOT
      + file                = ".github/workflows/python_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["atc-core"].github_repository_file.files[".github/workflows/rust_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Rust Checks
            
            env:
              TERM: xterm
            
            jobs:
              check:
                name: Checks
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-check
            
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - name: Build
                    run: make build
                  - name: Test
                    run: make rust-test
                  # Coming soon: grcov + push results to website or service (coveralls, etc.)
            
              fmt:
                name: Rustfmt
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-fmt
            
              clippy:
                name: Clippy
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-clippy
        EOT
      + file                = ".github/workflows/rust_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["atc-core"].github_repository_file.files[".github/workflows/sanity_checks.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            name: Sanity checks
            
            env:
              TERM: xterm
            
            on:
              push:
                branches:
                  - main
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make editorconfig-test
            
              toml:
                name: TOML format check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make toml-test
            
              cspell:
                name: Spelling check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make cspell-test
        EOT
      + file                = ".github/workflows/sanity_checks.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["atc-core"].github_repository_file.files[".taplo.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            exclude = ["**/.cargo/registry/**"]
            
            [formatting]
            reorder_keys  = false
            align_entries = true
            
            [[rule]]
            include = ["**/Cargo.toml"]
            keys = [
              "dependencies",
              "dev-dependencies",
              "build-dependencies",
              "target",
              "package",
              "workspace",
              "profile",
              "replace",
              "patch",
              "features",
              "badges",
            ]
            
            [rule.formatting]
            reorder_keys = true
        EOT
      + file                = ".taplo.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "atc-core"
      + sha                 = (known after apply)
    }

  # module.repository["atc-core"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "atc-core"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.repository["atc-core"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "atc-core"
      + team_id    = "services"
    }

  # module.repository["benchmarks"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHzRWt84Bqv9O"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["cla-bot"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHTAbhc4BmmRb"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["se-services"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH6H84M4BtBZe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["se-services"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH6H84M4BtBZp"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tool-simulation"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_Z3b84Bup88"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tool-simulation"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_Z3b84Bup8-"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tools"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Jf84BmmRe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcN"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYD"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqidv"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqid1"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_aGzM4Bu98o"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_aGzM4Bu98q"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["pricing"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOICuHTM4Bvld_"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["pricing"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOICuHTM4BvleC"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidt"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieG"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXs"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4BqmXz"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4Bqprl"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXu"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXx"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_tf["github"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOG6VIns4BpLGe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 20 to add, 28 to change, 0 to destroy.

Changes to Outputs:
  ~ repositories = {
      + atc-core        = {
          + branch         = {
              + develop = {
                  + branch        = "develop"
                  + etag          = (known after apply)
                  + id            = (known after apply)
                  + ref           = (known after apply)
                  + repository    = "atc-core"
                  + sha           = (known after apply)
                  + source_branch = "main"
                  + source_sha    = (known after apply)
                }
            }
          + branch_default = {
              + branch     = "develop"
              + id         = (known after apply)
              + repository = "atc-core"
            }
          + repository     = {
              + allow_auto_merge                        = false
              + allow_merge_commit                      = true
              + allow_rebase_merge                      = true
              + allow_squash_merge                      = true
              + archive_on_destroy                      = null
              + archived                                = false
              + auto_init                               = true
              + branches                                = (known after apply)
              + default_branch                          = (known after apply)
              + delete_branch_on_merge                  = true
              + description                             = "Air Traffic Control Library for UAM Activities"
              + etag                                    = (known after apply)
              + full_name                               = (known after apply)
              + git_clone_url                           = (known after apply)
              + gitignore_template                      = null
              + has_downloads                           = null
              + has_issues                              = true
              + has_projects                            = true
              + has_wiki                                = true
              + homepage_url                            = null
              + html_url                                = (known after apply)
              + http_clone_url                          = (known after apply)
              + id                                      = (known after apply)
              + ignore_vulnerability_alerts_during_read = null
              + is_template                             = false
              + license_template                        = null
              + merge_commit_message                    = "PR_TITLE"
              + merge_commit_title                      = "MERGE_MESSAGE"
              + name                                    = "atc-core"
              + node_id                                 = (known after apply)
              + pages                                   = []
              + private                                 = (known after apply)
              + repo_id                                 = (known after apply)
              + squash_merge_commit_message             = "COMMIT_MESSAGES"
              + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
              + ssh_clone_url                           = (known after apply)
              + svn_url                                 = (known after apply)
              + template                                = []
              + topics                                  = null
              + visibility                              = "public"
              + vulnerability_alerts                    = true
            }
        }
      ~ se-services     = {
          ~ branch         = {
              ~ develop = {
                  ~ etag          = "W/\"da325e12aaa817171de8c89d0537c28a3e1e457b3ea59efa6e39324811c539f2\"" -> "W/\"c50f9d618f7053705399a75a28a9481bf328e39b2a69693e0c2d9e4cb8160b6a\""
                    id            = "se-services:develop"
                  ~ sha           = "339c947a8b10f7fa7635eddd1b05893631ebae55" -> "52fd1ddceab3bbd6d77decd85593d8ebf004537b"
                    # (5 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
      ~ tool-simulation = {
          ~ branch         = {
              ~ develop = {
                  ~ etag          = "W/\"a0bc7aa26a1fd3f771410616ae8736c32445a9eade01627fd5c9cee577880918\"" -> "W/\"037068f7e475d651a97fc03d7a95f8db424784b7e8357cc850dd5c789ffdfbcf\""
                    id            = "tool-simulation:develop"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
      ~ website         = {
          ~ branch         = {
              ~ staging = {
                  ~ etag          = "W/\"8be0f8d271c21e114edf48e050722b500819274a9bfc450733c1fa7b42b42c39\"" -> "W/\"cc073a8e4fefd6b6af749c1ded570e0a9176a91c4d58aa31a6e1c999541b1f02\""
                    id            = "website:staging"
                  ~ sha           = "c195a02fbcc585047093d1312219b1ecdc49ae1c" -> "03c724e372fb6941a498c7c7e2a482400864f2f8"
                    # (5 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
        # (4 unchanged elements hidden)
    }

```

</details>

*Pusher: @ServiceDog, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*